Repository: franknfjr/frank_ferreira
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: br

source: About
br: Sobre

source: Actions
br: Ações

source: Made with
br: Feito com

source: Projects
br: Projetos

source: Timeline
br: Cronologia

source: Uses
br: Equipamentos

source: by
br: por

source: close
br: fechar

source: Home
br: Início

source: Attempting to reconnect
br: Tentando reconectar

source: Back to Homepage
br: Voltar para o Início

source: Error!
br: Erro!

source: Hang in there while we get back on track
br: Aguente firme enquanto voltamos aos trilhos

source: I am someone from Brazil 🇧🇷 with a strong passion for software. I find fulfillment in creating tools that enhance the ease and convenience of life for individuals.
br: Sou alguém do Brasil 🇧🇷 com uma forte paixão por software. Encontro satisfação em criar ferramentas que aprimoram a facilidade e a conveniência da vida para as pessoas.

source: Internal Server Error
br: Erro Interno do Servidor

source: Software Engineer
br: Engenheiro de Software

source: Something went wrong!
br: Algo deu errado!

source: Something's missing.
br: Está faltando algo.

source: Sorry, we can't find that page. You'll find lots to explore on the home page.
br: Desculpe, não conseguimos encontrar essa página. Você encontrará muitas coisas para explorar na página inicial.

source: Success!
br: Sucesso!

source: We can't find the internet
br: Não conseguimos encontrar a internet

source: Apr
br: Abr

source: Aug
br: Ago

source: Brazil
br: Brasil

source: Contribution settings
br: Configurações de Contribuição

source: Customize your pinned repositories
br: Personalize seus repositórios fixados

source: Dec
br: Dez

source: Feb
br: Fev

source: Fri
br: Sex.

source: Hello! I'm an enthusiastic programmer dedicated to exploring and refining my skills in the realm of software development. Throughout my journey, I've found my path in the Elixir ecosystem, where I've been involved in challenging projects that have allowed me to grow as a developer.
br: Olá! Sou um programador entusiasta dedicado a explorar e aprimorar minhas habilidades no campo do desenvolvimento de software. Ao longo da minha jornada, encontrei meu caminho no ecossistema Elixir, onde estive envolvido em projetos desafiadores que me permitiram crescer como desenvolvedor.

source: May
br: Mai

source: Mon
br: Seg

source: My passion for solving complex problems and crafting efficient solutions drives me to constantly pursue excellence in my work. I'm always eager to learn new technologies and innovative approaches to further enhance my expertise and make meaningful contributions to the projects I'm engaged in.
br: Minha paixão por resolver problemas complexos e criar soluções eficientes me motiva a buscar constantemente a excelência no meu trabalho. Estou sempre ansioso para aprender novas tecnologias e abordagens inovadoras para aprimorar ainda mais minha expertise e fazer contribuições significativas nos projetos em que estou envolvido.

source: Oct
br: Out

source: Organizations
br: Organizações

source: Sat
br: Sab

source: Sep
br: Set

source: Sun
br: Dom

source: Thu
br: Qui

source: Tue
br: Ter

source: Wed
br: Qua

source: Whether exploring new concepts, collaborating with teams, or tackling challenges, I am committed to evolving as a professional and making a positive impact on the software development community.
br: Seja explorando novos conceitos, colaborando com equipes ou enfrentando desafios, estou comprometido em evoluir como profissional e causar um impacto positivo na comunidade de desenvolvimento de software.

source: contributions in the last year
br: contribuições no último ano

source: same time
br: mesma hora

source: Date
br: Data

source: Listing all posts
br: Lista de artigos

source: Read more
br: Ler mais

source: Sign up for our newsletter
br: Inscreva-se em nossa newsletter

source: Subscribe
br: Inscreva-se

source: Subscribe to receive updates.
br: Inscreva-se para receber atualizações

source: The 'Healthcare' app provides a comprehensive overview of patient appointments, medications, phone calls, surgeries, financial transactions, and other relevant data, offering healthcare professionals a detailed insight into daily hospital indicators for better management and decision-making.
br: O aplicativo 'Healthcare' fornece uma visão abrangente das consultas dos pacientes, medicamentos, telefonemas, cirurgias, transações financeiras e outros dados relevantes, oferecendo aos profissionais de saúde uma visão detalhada dos indicadores diários do hospital para melhor gestão e tomada de decisões.

source: of my current
br: dos meus atuais

source: Client's projects
br: Projetos de Clientes

source: Freelance projects I've worked on
br: Projetos freelance em que trabalhei

source: Healthcare
br: Cuidados de saúde

source: I've created various projects with the aim of making a positive impact. While I've experimented with numerous endeavors, these particular ones hold a special place in my heart. Most of them are open-source, meaning you're welcome to explore the code and offer suggestions for enhancements if you feel inspired. Below is a
br: Criei vários projetos com o objetivo de causar um impacto positivo. Embora tenha experimentado inúmeras iniciativas, essas em particular têm um lugar especial no meu coração. A maioria delas é open-source, o que significa que você é bem-vindo para explorar o código e oferecer sugestões para melhorias, se sentir inspirado. Abaixo está uma

source: Introduction to Elixir and Phoenix
br: Introdução ao Elixir e Phoenix

source: My Journey Through Projects: Where Ideas Become Reality
br: Minha Jornada Através de Projetos: Onde Ideias Se Tornam Realidade

source: Open-source
br: Código-aberto

source: Open-source projects I've contributed to
br: Projetos open-source aos quais contribui

source: Repository for the Elixir and Phoenix mini-course, provided by the Applied Computing Laboratory at UFRA, functioning as a central repository for educational materials tailored to students and tech enthusiasts keen on exploring the dynamic realms of Elixir and Phoenix development.
br: Repositório para o mini-curso de Elixir e Phoenix, fornecido pelo Laboratório de Computação Aplicada da UFRA, funcionando como um repositório central para materiais educativos voltados para estudantes e entusiastas de tecnologia interessados em explorar os dinâmicos campos de desenvolvimento de Elixir e Phoenix.

source: The CDN (Content Delivery Network) system developed in Elixir was initially designed for internal file management. Using the Elixir language, the system offered an efficient and scalable solution to manage content distribution, optimizing access and file delivery across a network. This platform allowed for the storage, retrieval, and updating of files quickly and reliably, meeting the internal control needs of an organization.
br: O sistema CDN (Content Delivery Network) desenvolvido em Elixir foi inicialmente projetado para gerenciamento interno de arquivos. Usando a linguagem Elixir, o sistema ofereceu uma solução eficiente e escalável para gerenciar a distribuição de conteúdo, otimizando o acesso e a entrega de arquivos através de uma rede. Esta plataforma permitiu o armazenamento, recuperação e atualização de arquivos de forma rápida e confiável, atendendo às necessidades de controle interno de uma organização.

source: The Voter Intentions System is a digital platform designed to facilitate the collection and analysis of data related to voters' preferences in a specific political context.
br: O Sistema de Intenções de Voto é uma plataforma digital projetada para facilitar a coleta e análise de dados relacionados às preferências dos eleitores em um contexto político específico.

source: The study introduces Irrisusten, an information system to manage plantation irrigation. It automates agricultural production control and reduces water wastage. It features web and mobile interfaces, utilizing physical components like Arduino Uno, sensors, relays, and Bluetooth modules.
br: O estudo apresenta o Irrisusten, um sistema de informações para gerenciar a irrigação de plantações. Ele automatiza o controle da produção agrícola e reduz o desperdício de água. Possui interfaces web e mobile, utilizando componentes físicos como Arduino Uno, sensores, relés e módulos Bluetooth.

source: Voter Intentions System
br: Sistema de Intenções de Voto

source: list
br: lista

source: The Markdown in Elixir project converts Markdown files to HTML and Livebook using the Elixir language, leveraging its efficiency and scalability. It provides a flexible solution for developers to format text quickly and effectively in various online and data development contexts.
br: O projeto Markdown em Elixir converte arquivos Markdown para HTML e Livebook usando a linguagem Elixir, aproveitando sua eficiência e escalabilidade. Ele oferece uma solução flexível para desenvolvedores formatarem texto de forma rápida e eficaz em diversos contextos de desenvolvimento online e de dados.

source: 'Santa' gave me a Pentium
br: 'Noel' me deu um Pentium

source: (default apple)
br: (padrão apple)

source: Another graduation, this time from college. This time, distant relatives came to visit me to celebrate this moment. I am very grateful to everyone who, in one way or another, contributed to my journey, and without you, I wouldn't have achieved it. And yes, once again, graduated!
br: Outra graduação, desta vez da faculdade. Desta vez, parentes distantes vieram me visitar para celebrar este momento. Sou muito grato a todos que, de alguma forma, contribuíram para a minha jornada, e sem vocês, eu não teria conseguido. E sim, mais uma vez, graduado!

source: Aug, 1994
br: Ago, 1994

source: Beginning of College
br: Início da Faculdade

source: Beginning of technical studies
br: Início dos estudos técnicos

source: Born
br: Nasci

source: Completion of College
br: Conclusão da Faculdade

source: Completion of technical studies
br: Conclusão dos estudos técnicos

source: Federal Institute of Para - Ananindeua
br: Instituto Federal do Pará - Ananindeua

source: Federal Rural University of Amazonia - Belém
br: Universidade Federal Rural da Amazônia - Belém

source: First Job!
br: Primeiro trampo!

source: First PC
br: Primeiro PC!

source: First apresentation in Seminar
br: Primeira apresentação em um Seminário

source: First release in prod.
br: Primeiro release em prod.

source: First trip presenting programming
br: Primeira viagem de apresentaçao sobre programação

source: Graduation in Information Systems
br: Graduaçao em Sistemas de Informação

source: Hello World Delphi
br: Olá Mundo Delphi

source: Hello World!
br: Olá Mundo!

source: Here are some of the hardware devices I use in my daily life, whether it's for studying programming or leisure.
br: Aqui estão alguns dos dispositivos de hardware que uso no meu dia a dia, seja para estudar programação ou para lazer.

source: I finally brought to life this project that I have been thinking about for years but hadn't started. It ended up becoming a goal for 2023 at the last minute. Exciting updates coming soon!!!
br: Finalmente trouxe à vida este projeto que venho pensando há anos, mas que ainda não havia começado. Acabou se tornando um objetivo para 2023 na última hora. Atualizações emocionantes em breve!!!

source: I opted for Information Systems instead of Journalism. I arrived smurfing, already familiar with Portuguese pseudocode and C by that time.
br: Optei por Sistemas de Informação em vez de Jornalismo. Cheguei 'smurfando', já familiarizado com pseudocódigo em português e C naquela época.

source: I remember that the idea for the scientific article came from a friend in environmental engineering, and simply, me and two other crazy friends embraced the cause and ended up traveling to Rio Grande do Norte - Natal to present a paper on the topic of Applied Computing to Environmental Management and Natural Resources.
br: Lembro que a ideia para o artigo científico veio de um amigo de engenharia ambiental, e simplesmente, eu e dois outros amigos malucos abraçamos a causa e acabamos viajando para Rio Grande do Norte - Natal para apresentar um trabalho sobre o tema Computação Aplicada à Gestão Ambiental e Recursos Naturais.

source: I submitted my first academic work entitled 'MOBILE APPLICATION: DEVELOPMENT OF A QUIZ GAME WITH COMPUTER SCIENCE CONTENT' and presented it at the VIII Seminar on Scientific, Technological, and Innovation Initiation.
br: Submeti meu primeiro trabalho acadêmico intitulado 'APLICATIVO MÓVEL: DESENVOLVIMENTO DE UM JOGO DE QUIZ COM CONTEÚDO DE CIÊNCIAS DA COMPUTAÇÃO' e o apresentei no VIII Seminário de Iniciação Científica, Tecnológica e em Inovação.

source: It was a gift from my friend, my first DVD course on Hacking! I remembered to make a browser at the end and it was amazing, I had no idea what I was writing but I knew what I wanted.
br: Foi um presente do meu amigo, meu primeiro curso em DVD sobre Hacking! Lembro que fiz um navegador no final e foi incrível; eu não tinha ideia do que estava escrevendo, mas sabia o que queria.

source: It was an amazing experience, firstly because I was embraced by a teacher who believed in my potential when everyone raised difficulties. She proposed to teach programming to underprivileged children using the Scratch tool, where they could take their first steps in programming.
br: Foi uma experiência incrível, primeiramente porque fui acolhido por uma professora que acreditou no meu potencial quando todos levantaram dificuldades. Ela propôs ensinar programação para crianças de baixo poder aquisitivo usando a ferramenta Scratch, onde elas poderiam dar seus primeiros passos na programação.

source: It was an honor to be one of the first four students to graduate in computer science from the municipality of Ananindeua. I had the opportunity to learn a lot and make great friends.
br: Foi uma honra ser um dos primeiros quatro alunos a se formar em ciência da computação no município de Ananindeua. Tive a oportunidade de aprender muito e fazer grandes amigos.

source: Ladies and gentlemen, welcome!
br: Senhoras e senhores, sejam bem-vindos!

source: May, 2022
br: Mai, 2022

source: My first job as a backend developer in Elixir, it was a fantastic few months. I learned the equivalent of 10 years in 1 year, personally met amazing friends who provided great guidance.
br: Meu primeiro trabalho como desenvolvedor backend em Elixir foi um período fantástico. Aprendi o equivalente a 10 anos em 1 ano e conheci pessoalmente amigos incríveis que forneceram ótimas orientações.

source: Official launch of this website
br: Lançamento oficial deste site

source: On site
br: Presencial

source: One year later of my first code in Delphi, I started studying computing in my hometown, being one of the first graduates in the city's history.
br: Um ano após meu primeiro código em Delphi, comecei a estudar computação na minha cidade natal, sendo um dos primeiros graduados na história da cidade.

source: Programming class with Scratch for underprivileged children.
br: Aula de programação com Scratch para crianças de baixo poder aquisitivo.

source: Remote
br: Remoto

source: Sep, 2016
br: Set, 2016

source: Soon, I'll create a route `/hardware/:device` to provide detailed explanations of the specifications and configurations that I use.
br: Em breve, criarei uma rota `/hardware/:device` para fornecer explicações detalhadas das especificações e configurações que eu uso.

source: Teaching to learn
br: Ensinar para aprender

source: Technical degree graduation in computer science.
br: Graduação técnica em ciência da computação.

source: The Model City - Castanhal
br: A Cidade Modelo - Castanhal

source: The most amazing experience I've ever had in my life, I was able to connect with various people from different fields, where I could apply my knowledge for a long time and absorb knowledge from others. A journey full of challenges in personal and technical development where I could leave my mark and assist everyone.
br: A experiência mais incrível que já tive na minha vida, consegui me conectar com várias pessoas de diferentes áreas, onde pude aplicar meu conhecimento por um longo tempo e absorver conhecimento de outros. Uma jornada cheia de desafios no desenvolvimento pessoal e técnico, onde pude deixar minha marca e ajudar a todos.

source: The same train of thought as before, and here are some of the software applications I use on a daily basis.
br: O mesmo raciocínio de antes, e aqui estão alguns dos aplicativos de software que uso no dia a dia.

source: With a lot of sacrifice, my parents gave me a super fast Pentium computer on Christmas Eve. I remember putting in a password and forgetting it the next day. lol
br: Com muito sacrifício, meus pais me deram um computador Pentium super rápido na véspera de Natal. Lembro de colocar uma senha e esquecê-la no dia seguinte. lol

source: XXXVIII Brazilian Computer Society Congress (CSBC 2018)
br: XXXVIII Congresso da Sociedade Brasileira de Computação (CSBC 2018)

source: Yes, my first code was made in Delphi
br: Sim, meu primeiro código foi feito em Delphi.

source: December
br: Dezembro

source: February
br: Fevereiro

source: Invalid month
br: Mês Inválido

source: Invalid weekday
br: Semana Inválida

source: November
br: Novembro

source: Saturday
br: Sábado

source: September
br: Setembro

source: Thursday
br: Quinta

source: Wednesday
br: Quarta

source: Go back
br: Voltar
